Revit 2027 API
FluidType.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<FluidTemperature> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of FluidTemperature)
public:
virtual IEnumerator<FluidTemperature^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<FluidTemperature>
override GetEnumerator : unit -> IEnumerator<FluidTemperature>
Return Value
IEnumerator<FluidTemperature>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace